{
  "Error":"0",
  "Time":0.0168,
  "Total":"5050",
  "Page":1,
  "Books":[
    {
      "ID":3005308697,
      "Title":"HTTP: The Definitive Guide",
      "Description":"Behind every web transaction lies the Hypertext Transfer Protocol (HTTP) - the language of web browsers and servers, of portals and search engines, of e-commerce and web services. Understanding HTTP is essential for practically all web-based programm ...",
      "Image":"http://s.it-ebooks-api.info/3/http_the_definitive_guide.jpg",
      "isbn":"9781565925090"
    },
    {
      "ID":1288910534,
      "Title":"Nginx HTTP Server, 2nd Edition",
      "SubTitle":"Make the most of your infrastructure and serve pages faster than ever with Nginx",
      "Description":"Nginx is a lightweight HTTP server designed for high-traffic websites, with network scalability as the primary objective. With the advent of high speed Internet access, short loading times and fast transfer rates have become a necessity. This free, o ...",
      "Image":"http://s.it-ebooks-api.info/14/nginx_http_server_2nd_edition.jpg",
      "isbn":"9781782162322"
    },
    {
      "ID":3880910135,
      "Title":"Using Google App Engine",
      "SubTitle":"Building Web Applications",
      "Description":"With this book, you can build exciting, scalable web applications quickly and confidently, using Google App Engine -- even if you have little or no experience in programming or web development. Using Google App Engine provides an overview of the tool ...",
      "Image":"http://s.it-ebooks-api.info/3/using_google_app_engine.jpg",
      "isbn":"9780596800697"
    },
    {
      "ID":3348228478,
      "Title":"Programming Web Services with SOAP",
      "Description":"The web services architecture provides a new way to think about and implement application - to - application integration and interoperability that makes the development platform irrelevant. Two applications, regardless of operating system, programmin ...",
      "Image":"http://s.it-ebooks-api.info/3/programming_web__services_with_soap.jpg",
      "isbn":"9780596000950"
    },
    {
      "ID":1707991865,
      "Title":"RESTful Web Services Cookbook",
      "SubTitle":"Solutions for Improving Scalability and Simplicity",
      "Description":"While the REST design philosophy has captured the imagination of web and enterprise developers alike, using this approach to develop real web services is no picnic. This cookbook includes more than 100 recipes to help you take advantage of REST, HTTP ...",
      "Image":"http://s.it-ebooks-api.info/3/restful_web_services_cookbook.jpg",
      "isbn":"9780596801687"
    },
    {
      "ID":311101840,
      "Title":"Sinatra: Up and Running",
      "SubTitle":"Ruby for the Web, Simply",
      "Description":"Take advantage of Sinatra, the Ruby-based web application library and domain-specific language used by GitHub, LinkedIn, Engine Yard, and other prominent organizations. With this concise book, you will quickly gain working knowledge of Sinatra and it ...",
      "Image":"http://s.it-ebooks-api.info/3/sinatra_up_and_running.jpg",
      "isbn":"9781449304232"
    },
    {
      "ID":1041547456,
      "Title":"Camel in Action",
      "Description":"Apache Camel is a Java framework that lets you implement the standard enterprise integration patterns in a few lines of code. With a concise but sophisticated DSL you snap integration logic into your app, Lego-style, using Java, XML, or Scala. Camel ...",
      "Image":"http://s.it-ebooks-api.info/5/camel_in_action.jpg",
      "isbn":"9781935182368"
    },
    {
      "ID":3760113695,
      "Title":"Nagios",
      "SubTitle":"System and Network Monitoring",
      "Description":"Nagios, which runs on Linux and most *nix variants, can be configured to continuously monitor network services such as SMTP, POP3, HTTP, NNTP, SSH, and FTP. It can also supervise host resources (processor load, disk and memory usage, running processe ...",
      "Image":"http://s.it-ebooks-api.info/15/nagios.jpg",
      "isbn":"3937514090"
    },
    {
      "ID":1773000760,
      "Title":"Spring for Android Starter",
      "SubTitle":"Leverage Spring for Android to create RESTful and OAuth Android apps",
      "Description":"Learn something new in an Instant! A short, fast, focused guide delivering immediate results. Learn what Spring for Android adds to the Android developer toolkit. Learn how to debug your Android communication layer observing HTTP requests and respons ...",
      "Image":"http://s.it-ebooks-api.info/14/instant_spring_for_android_starter.jpg",
      "isbn":"9781782161905"
    },
    {
      "ID":280504893,
      "Title":"Foundations of Python Network Programming, 2nd Edition",
      "SubTitle":"The comprehensive guide to building network applications with Python",
      "Description":"You will learn fundamentals like IP, TCP, DNS and SSL by using working Python programs; you will also be able to familiarize yourself with infrastructure components like memcached and message queues. You can also delve into network server designs, an ...",
      "Image":"http://s.it-ebooks-api.info/6/foundations_of_python_network_programming_2nd_edition.jpg",
      "isbn":"9781430230038"
    },
    {
      "ID":1422299569,
      "Title":"Burp Suite Starter",
      "SubTitle":"Get up and running with Burp Suite using this hands-on practical guide",
      "Description":"Learn something new in an Instant! A short, fast, focused guide delivering immediate results. Intercept HTTP/S requests with Burp Proxy. Tamper and analyze responses. Perform enumeration using the Burp Suite Map and Spider. Launch an automatic scan w ...",
      "Image":"http://s.it-ebooks-api.info/14/burp_suite_starter.jpg",
      "isbn":"9781849695183"
    },
    {
      "ID":1096327173,
      "Title":"PHP 6 and MySQL 6 Bible",
      "Description":"MySQL is the leading open source database on the market and PHP continues to dominate the server side of the scripting market - together, they are the most popular and common team for creating dynamic, database-driven web sites. This comprehensive bo ...",
      "Image":"http://s.it-ebooks-api.info/9/php_6_and_mysql_6_bible.jpg",
      "isbn":"9780470384503"
    },
    {
      "ID":438339616,
      "Title":"The Definitive Guide to HTML5 WebSocket",
      "Description":"The Definitive Guide to HTML5 WebSocket is the ultimate insider's WebSocket resource. This revolutionary new web technology enables you to harness the power of true real-time connectivity and build responsive, modern web applications. This book co ...",
      "Image":"http://s.it-ebooks-api.info/6/the_definitive_guide_to_html5_websocket.jpg",
      "isbn":"9781430247401"
    },
    {
      "ID":2532992401,
      "Title":"Play Framework Cookbook",
      "SubTitle":"Over 60 incredibly effective recipes to take you under the hood and leverage advanced concepts of the Play framework",
      "Description":"The Play framework is the new kid on the block of Java frameworks. By breaking with existing standards the play framework tries not to abstract away from HTTP as most web frameworks do, but tightly integrates with it. This means quite a shift for Jav ...",
      "Image":"http://s.it-ebooks-api.info/14/play_framework_cookbook.jpg",
      "isbn":"9781849515528"
    },
    {
      "ID":2302208914,
      "Title":"Pro ASP.NET Web API Security",
      "SubTitle":"Securing ASP.NET Web API",
      "Description":"ASP.NET Web API is a key part of ASP.NET MVC 4 and the platform of choice for building RESTful services that can be accessed by a wide range of devices. Everything from JavaScript libraries to RIA plugins, RFID readers to smart phones can consume you ...",
      "Image":"http://s.it-ebooks-api.info/6/pro_asp.net_web_api_security.jpg",
      "isbn":"9781430257820"
    },
    {
      "ID":31602642,
      "Title":"JavaServer Faces in Action",
      "Description":"JavaServer Faces helps streamline your web development through the use of UI components and events (instead of HTTP requests and responses). JSF components (buttons, text boxes, checkboxes, data grids, etc.) live between user requests, which eliminat ...",
      "Image":"http://s.it-ebooks-api.info/5/javaserver_faces_in_action.jpg",
      "isbn":"9788177224191"
    },
    {
      "ID":3613441861,
      "Title":"OData Programming Cookbook for .NET Developers",
      "SubTitle":"70 fast-track, example-driven recipes with clear instructions and details for OData programming with .NET Framework",
      "Description":"Odata (Open Data Protocol) is a Web protocol for querying and updating data that provides a way to unlock your data and free it from silos that exist in applications today. OData enables data access among a variety of applications, services, and stor ...",
      "Image":"http://s.it-ebooks-api.info/14/odata_programming_cookbook_for_.net_developers.jpg",
      "isbn":"9781849685924"
    },
    {
      "ID":992801943,
      "Title":"CherryPy Essentials",
      "SubTitle":"Rapid Python Web Application Development",
      "Description":"CherryPy is a Python library for web development that allows developers to build web applications in the same way as any other object-oriented Python program. Enriched by several years of active development, it has become one of the most established ...",
      "Image":"http://s.it-ebooks-api.info/14/cherrypy_essentials.jpg",
      "isbn":"9781904811848"
    },
    {
      "ID":230770162,
      "Title":"Mastering Nginx",
      "SubTitle":"An in-depth guide to configuring NGINX for any situation, including numerous examples and reference tables describing each directive",
      "Description":"NGINX is a high-performance HTTP server and mail proxy designed to use very few system resources. With the many tutorials and example configurations floating around the Web, it is difficult to know how to properly configure NGINX to meet your expecta ...",
      "Image":"http://s.it-ebooks-api.info/14/mastering_nginx.jpg",
      "isbn":"9781849517447"
    },
    {
      "ID":1825913623,
      "Title":"Learning Play! Framework 2",
      "SubTitle":"Start developing awesome web applications with this friendly, practical guide to the Play! Framework",
      "Description":"The Learning Play! Framework 2 has been created for web developers that are building web applications. The core idea is to focus on the HTTP features and to enable them through a simplification lens. Building a web application no longer requires a co ...",
      "Image":"http://s.it-ebooks-api.info/14/learning_play_framework_2.jpg",
      "isbn":"9781782160120"
    },
    {
      "ID":3305776852,
      "Title":"Fast ASP.NET Websites",
      "Description":"Fast ASP.NET Websites delivers just what it promises - practical, hands-on guidance to create faster, more efficient ASP.NET sites and applications. This book offers step-by-step .NET-specific examples showing you how to apply classic page optimizati ...",
      "Image":"http://s.it-ebooks-api.info/5/fast_asp.net_websites.jpg",
      "isbn":"9781617291258"
    },
    {
      "ID":852567390,
      "Title":"High Performance Browser Networking",
      "SubTitle":"What every web developer should know about networking and web performance",
      "Description":"How prepared are you to build fast and efficient web applications? This eloquent book provides what every web developer should know about the network, from fundamental limitations that affect performance to major innovations for building even more po ...",
      "Image":"http://s.it-ebooks-api.info/3/high_performance_browser_networking.jpg",
      "isbn":"9781449344764"
    },
    {
      "ID":4231328426,
      "Title":"Designing Evolvable Web APIs with ASP.NET",
      "SubTitle":"Harnessing the power of the web",
      "Description":"Design and build Web APIs for a broad range of clients—including browsers and mobile devices—that can adapt to change over time. This practical, hands-on guide takes you through the theory and tools you need to build evolvable HTTP services with ...",
      "Image":"http://s.it-ebooks-api.info/3/designing_evolvable_web_apis_with_asp.net.jpg",
      "isbn":"9781449337711"
    },
    {
      "ID":555913251,
      "Title":"Data Push Apps with HTML5 SSE",
      "SubTitle":"Pragmatic Solutions for Real-World Clients",
      "Description":"Make sure your website or web application users get content updates right now with minimal latency. This concise guide shows you how to push new data from the server to clients with HTML5 Server-Sent Events (SSE), an exceptional technology that doesn ...",
      "Image":"http://s.it-ebooks-api.info/3/data_push_apps_with_html5_sse.jpg",
      "isbn":"9781449371937"
    },
    {
      "ID":1260123246,
      "Title":"Alfresco CMIS",
      "SubTitle":"Everything you need to know to start coding integrations with a content management server such as Alfresco in a standard way",
      "Description":"Content Management Servers (CMS) have been around for a very long time, both proprietary and open source ones, but there has not been a standard way of talking to them until recently. The Content Management Interoperability Services (CMIS) standard p ...",
      "Image":"http://s.it-ebooks-api.info/14/alfresco_cmis.jpg",
      "isbn":"9781782163527"
    },
    {
      "ID":654062408,
      "Title":"SignalR Real-time Application Cookbook",
      "SubTitle":"Use SignalR to create real-time, bidirectional, and asynchronous applications based on standard web technologies",
      "Description":"SignalR is a recent addition to ASP.NET, which allows you to add real-time functionalities to your applications. SignalR enables bidirectional communication between client and server over HTTP, transparently, and ensures you're always provided with t ...",
      "Image":"http://s.it-ebooks-api.info/14/signalr_real-time_application_cookbook.jpg",
      "isbn":"9781783285952"
    },
    {
      "ID":90507564,
      "Title":"Node.js in Action",
      "Description":"JavaScript on the server? You bet. Node.js is a JavaScript server capable of supporting scalable, high-performance web applications. Using asynchronous I/O, the server can do more than one thing at a time, a key requirement for real-time apps like ch ...",
      "Image":"http://s.it-ebooks-api.info/5/node.js_in_action.jpg",
      "isbn":"9781617290572"
    },
    {
      "ID":2031356150,
      "Title":"Foundations of Python Network Programming, 3rd Edition",
      "Description":"Foundations of Python Network Programming, Third Edition, covers all of the classic topics found in the second edition of this book, including network protocols, network data and errors, email, server architecture, and HTTP and web applications, plus ...",
      "Image":"http://s.it-ebooks-api.info/6/foundations_of_python_network_programming_3rd_edition.jpg",
      "isbn":"9781430258544"
    },
    {
      "ID":1117792701,
      "Title":"Building Mobile Applications Using Kendo UI Mobile and ASP.NET Web API",
      "SubTitle":"Get started with Kendo UI Mobile and learn how to integrate it with HTTP-based services built using ASP.NET Web API",
      "Description":"Building Mobile Applications Using Kendo UI Mobile and ASP.NET Web API helps you to understand the concept of building mobile applications using HTML5 based frameworks, specifically Kendo UI Mobile. It teaches you in a simple step-by-step manner how ...",
      "Image":"http://s.it-ebooks-api.info/14/building_mobile_applications_using_kendo_ui_mobile_and_asp.net_web_api.jpg",
      "isbn":"9781782160922"
    },
    {
      "ID":1948692065,
      "Title":"Linked Data",
      "SubTitle":"Structured data on the Web",
      "Description":"The current Web is mostly a collection of linked documents useful for human consumption. The evolving Web includes data collections that may be identified and linked so that they can be consumed by automated processes. The W3C approach to this is Lin ...",
      "Image":"http://s.it-ebooks-api.info/5/linked_data.jpg",
      "isbn":"9781617290398"
    },
    {
      "ID":4083667472,
      "Title":"Learning Internet of Things",
      "SubTitle":"Explore and learn about Internet of Things with the help of engaging and enlightening tutorials designed for Raspberry Pi",
      "Description":"This book starts by exploring the popular HTTP, UPnP, CoAP, MQTT, and XMPP protocols. You will learn how protocols and patterns can put limitations on network topology and how they affect the direction of communication and the use of firewalls. Thing ...",
      "Image":"http://s.it-ebooks-api.info/14/learning_internet_of_things.jpg",
      "isbn":"9781783553532"
    },
    {
      "ID":1245732744,
      "Title":"Python Requests Essentials",
      "SubTitle":"Learn how to integrate your applications seamlessly with web services using Python Requests",
      "Description":"Python is one of the most popular programming languages of our era; the Python Requests library is one of the world's best clients, with the highest number of downloads. It allows hassle-free interactions with web applications using simple procedures ...",
      "Image":"http://s.it-ebooks-api.info/14/python_requests_essentials.jpg",
      "isbn":"9781784395414"
    },
    {
      "ID":164760705,
      "Title":"RESTful Web API Design with Node.js",
      "SubTitle":"Design and implement comprehensive RESTful solutions in Node.js",
      "Description":"In this era of cloud computing, every data provisioning solution is built in a scalable and fail-safe way. Thus, when building RESTful services, the right choice of the underlying platform is vital. Node.js, with its asynchronous, event-driven archit ...",
      "Image":"http://s.it-ebooks-api.info/14/restful_web_api_design_with_node.js.jpg",
      "isbn":"9781783985869"
    },
    {
      "ID":2723322428,
      "Title":"Express.js Blueprints",
      "SubTitle":"Learn to use Express.js pragmatically by creating five fun and robust real-world APIs, with a bonus chapter on Koa.js",
      "Description":"APIs are at the core of every serious web application. Express.js is the most popular framework for building on top of Node.js, an exciting tool that is easy to use and allows you to build APIs and develop your backend in JavaScript. Express.js Bluep ...",
      "Image":"http://s.it-ebooks-api.info/14/express.js_blueprints.jpg",
      "isbn":"9781783983025"
    },
    {
      "ID":694453161,
      "Title":"WebSocket",
      "Description":"HTML5 WebSockets offer app developers a much smaller and more efficient way of communicating than classic HTTP for smoother, faster, and full-duplex communication with the server. With this practical book, you'll learn how to take advantage of WebSoc ...",
      "Image":"http://s.it-ebooks-api.info/3/websocket_early_release.jpg",
      "isbn":"9781449369279"
    },
    {
      "ID":1216142293,
      "Title":"Building Web Services with Microsoft Azure",
      "SubTitle":"Quickly develop scalable, REST-based applications or services and learn how to manage them using Microsoft Azure",
      "Description":"There's a plethora of development tools and frameworks available today. But Microsoft Azure provides a scalable and manageable platform for customers to easily deploy, monitor, and troubleshoot their cloud-based applications. Its seamless integration ...",
      "Image":"http://s.it-ebooks-api.info/14/building_web_services_with_microsoft_azure.jpg",
      "isbn":"9781784398378"
    },
    {
      "ID":745430959,
      "Title":"How to Implement Market Models Using VBA",
      "Description":"How to Implement Market Models Using VBA makes solving complex valuation issues accessible to any financial professional with a taste for mathematics. With a focus on the clarity of code, this practical introductory guide includes chapters on VBA fun ...",
      "Image":"http://s.it-ebooks-api.info/9/how_to_implement_market_models_using_vba.jpg",
      "isbn":"9781118962008"
    },
    {
      "ID":2374684052,
      "Title":"RESTful Java Web Services Security",
      "SubTitle":"Secure your RESTful applications against common vulnerabilities",
      "Description":"This book will serve as a practical companion for you to learn about common vulnerabilities when using RESTful services, and will provide you with an indispensable knowledge of the tools you can use to implement and test security on your applications ...",
      "Image":"http://s.it-ebooks-api.info/14/restful_java_web_services_security.jpg",
      "isbn":"9781783980109"
    },
    {
      "ID":1298287174,
      "Title":"Elasticsearch in Action",
      "Description":"Modern search seems like magic—you type a few words and the search engine appears to know what you want. With the Elasticsearch real-time search and analytics engine, you can give your users this magical experience without having to do complex low- ...",
      "Image":"http://s.it-ebooks-api.info/5/elasticsearch_in_action.jpg",
      "isbn":"9781617291623"
    },
    {
      "ID":982901204,
      "Title":"Mastering NetScaler VPX",
      "SubTitle":"Learn how to deploy and configure all the available Citrix NetScaler features with the best practices and techniques you need to know",
      "Description":"Citrix NetScaler is one of the best Application Delivery Controller products in the world. The Application Delivery Controllers are commonly used for load balancing purposes, to optimize traffic, and to perform extra security settings. This book w ...",
      "Image":"http://s.it-ebooks-api.info/14/mastering_netscaler_vpx.jpg",
      "isbn":"9781785281730"
    },
    {
      "ID":1322048410,
      "Title":"Boost.Asio C++ Network Programming Cookbook",
      "SubTitle":"Over 25 hands-on recipes to create robust and highly-efficient cross-platform distributed applications with the Boost.Asio library",
      "Description":"Starting with recipes demonstrating the execution of basic Boost.Asio operations, the book goes on to provide ready-to-use implementations of client and server applications from simple synchronous ones to powerful multithreaded scalable solutions. Fi ...",
      "Image":"http://s.it-ebooks-api.info/14/boost.asio_c_network_programming_cookbook.jpg",
      "isbn":"9781783986545"
    },
    {
      "ID":784545440,
      "Title":"Web Development with Go",
      "SubTitle":"Building Scalable Web Apps and RESTful Services",
      "Description":"Take a deep dive into web development using the Go programming language to build web apps and RESTful services to create reliable and efficient software. Web Development with Go provides Go language fundamentals and then moves on to advanced web deve ...",
      "Image":"http://s.it-ebooks-api.info/6/web_development_with_go.jpg",
      "isbn":"9781484210536"
    },
    {
      "ID":425866405,
      "Title":"A Peek at Computer Electronics",
      "SubTitle":"Things you Should Know",
      "Description":"Are you a programmer or computer enthusiast? Do you feel comfortable with methods, functions, and variables? Do you wish you knew more about how the computer made it all work? Now you can. From basic electronics to advanced computer hardware, you'll ...",
      "Image":"http://s.it-ebooks-api.info/1/a_peek_at_computer_electronics.jpg",
      "isbn":"9780977616688"
    },
    {
      "ID":4192456175,
      "Title":"Advanced Rails Recipes",
      "SubTitle":"84 New Ways to Build Stunning Rails Apps",
      "Description":"With the help of a community of Rails chefs in the kitchen, here are 84 new ways to kick your Rails apps up a notch. Advanced Rails Recipes is a collection of practical recipes for spicing up your web application without a lot of prep and cleanup. Yo ...",
      "Image":"http://s.it-ebooks-api.info/1/advanced_rails_recipes.jpg",
      "isbn":"9780978739225"
    },
    {
      "ID":2069212718,
      "Title":"Agile Web Development with Rails, 3rd Edition",
      "Description":"Rails just keeps on changing. Rails 3 and Ruby 1.9 bring hundreds of improvements, including new APIs and substantial performance enhancements. The fourth edition of this award-winning classic has been reorganized and refocused so it's more useful th ...",
      "Image":"http://s.it-ebooks-api.info/1/agile_web_development_with_rails_3rd_edition.jpg",
      "isbn":"9781934356166"
    },
    {
      "ID":3424641975,
      "Title":"Agile Web Development with Rails, 4th Edition",
      "Description":"Rails just keeps on changing. Rails 3 and Ruby 1.9 bring hundreds of improvements, including new APIs and substantial performance enhancements. The fourth edition of this award-winning classic has been reorganized and refocused so it's more useful th ...",
      "Image":"http://s.it-ebooks-api.info/1/agile_web_development_with_rails_4th_edition.jpg",
      "isbn":"9781934356548"
    },
    {
      "ID":415000254,
      "Title":"Arduino",
      "SubTitle":"A Quick-Start Guide",
      "Description":"Arduino is an open-source platform that makes DIY electronics projects easier than ever. Readers with no electronics experience can create their first gadgets within a few minutes. This book is up-to-date for the new Arduino Uno board, with step-by-s ...",
      "Image":"http://s.it-ebooks-api.info/1/arduino.jpg",
      "isbn":"9781934356661"
    },
    {
      "ID":3233402574,
      "Title":"Beginning Mac Programming",
      "SubTitle":"Develop with Objective-C and Cocoa",
      "Description":"You already know the reasons to get into Mac programming: millions of users rely on the Mac as their primary operating system. If you are searching for a new job, acquiring a skill set, or simply inspired to develop software for the Mac, Beginning Ma ...",
      "Image":"http://s.it-ebooks-api.info/1/beginning_mac_programming.jpg",
      "isbn":"9781934356517"
    },
    {
      "ID":1511054193,
      "Title":"Behind Closed Doors",
      "SubTitle":"Secrets of Great Management",
      "Description":"Great management is difficult to see as it occurs. Great management happens in one-on-one meetings and with other managers all in private. It's hard to learn management by example when you can't see it. Find out what goes on Behind Closed Doors an ...",
      "Image":"http://s.it-ebooks-api.info/1/behind_closed_doors.jpg",
      "isbn":"9780976694021"
    },
    {
      "ID":4019654241,
      "Title":"Best of Ruby Quiz",
      "Description":"Sharpen your Ruby programming skills with twenty-five challenging problems from Ruby Quiz. Read the problems, work out a solution, and compare your solution with others. This book is a collection of highlights from the first year of Ruby Quiz challen ...",
      "Image":"http://s.it-ebooks-api.info/1/best_of_ruby_quiz.jpg",
      "isbn":"9780976694076"
    }
  ]
}